app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-02-25 22:54:15.342663"], ["updated_at", "2019-02-25 22:54:15.342663"]]
---
  def create
    @sc = SchoolClass.create(params[:school_class])

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-02-25 23:17:48.328654"], ["id", 1]]
---
  def update
    get_sc
    @sc.update(params[:school_class])