app/controllers/students_controller.rb

  def create
    @s = Student.create(params[:student])
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-02-25 23:30:08.946986"], ["updated_at", "2019-02-25 23:30:08.946986"]]

  def update
    get_s.update(params[:student])
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-02-25 23:34:55.607263"], ["id", 1]]